In [2]:
#dataframes

In [219]:
import numpy as np
import pandas as pd

In [220]:
from numpy.random import randn

In [221]:
np.random.seed(101)# np.random.seed() is used to generate random numbers.

In [222]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','y','Z'])

In [223]:
df

          W         X         y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [224]:
df['W'][0]

2.706849839399938

In [225]:
type(df)

pandas.core.frame.DataFrame

In [226]:
type(df['W'])

pandas.core.series.Series

In [227]:
  df.W  #not advisable

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [228]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [229]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [230]:
df['new'] = df['W'] + df['y']

In [231]:
df['new']

A    3.614819
B   -0.196959
C   -1.489355
D   -0.744542
E    2.796762
Name: new, dtype: float64

In [232]:
df

          W         X         y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [233]:
 df.drop('y', axis=1, inplace =True)

In [234]:
df

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
B  0.651118 -0.319318  0.605965 -0.196959
C -2.018168  0.740122 -0.589001 -1.489355
D  0.188695 -0.758872  0.955057 -0.744542
E  0.190794  1.978757  0.683509  2.796762

In [235]:
 df.drop('E', axis=0)

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
B  0.651118 -0.319318  0.605965 -0.196959
C -2.018168  0.740122 -0.589001 -1.489355
D  0.188695 -0.758872  0.955057 -0.744542

In [236]:
df.shape

(5, 4)

In [237]:
df

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
B  0.651118 -0.319318  0.605965 -0.196959
C -2.018168  0.740122 -0.589001 -1.489355
D  0.188695 -0.758872  0.955057 -0.744542
E  0.190794  1.978757  0.683509  2.796762

In [238]:
df.loc['A']

W      2.706850
X      0.628133
Z      0.503826
new    3.614819
Name: A, dtype: float64

In [239]:
df.loc[['A','E']] #real parameter

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
E  0.190794  1.978757  0.683509  2.796762

In [240]:
df.iloc[2]  #number: numerical based index

W     -2.018168
X      0.740122
Z     -0.589001
new   -1.489355
Name: C, dtype: float64

In [241]:
df.loc['A','new']  #selecting a row and a column

3.6148192858764814

In [242]:
df.loc[['A','B'],['W','new']]

          W       new
A  2.706850  3.614819
B  0.651118 -0.196959

In [243]:
#part2

In [244]:
#conditional selection

In [245]:
df>0  #shows in boolean

       W      X      Z    new
A   True   True   True   True
B   True  False   True  False
C  False   True  False  False
D   True  False   True  False
E   True   True   True   True

In [246]:
df[df > 0]  #showing values

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
B  0.651118       NaN  0.605965       NaN
C       NaN  0.740122       NaN       NaN
D  0.188695       NaN  0.955057       NaN
E  0.190794  1.978757  0.683509  2.796762

In [247]:
df

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
B  0.651118 -0.319318  0.605965 -0.196959
C -2.018168  0.740122 -0.589001 -1.489355
D  0.188695 -0.758872  0.955057 -0.744542
E  0.190794  1.978757  0.683509  2.796762

In [248]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [249]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [250]:
df[df['W']>0]

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
B  0.651118 -0.319318  0.605965 -0.196959
D  0.188695 -0.758872  0.955057 -0.744542
E  0.190794  1.978757  0.683509  2.796762

In [251]:
df

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
B  0.651118 -0.319318  0.605965 -0.196959
C -2.018168  0.740122 -0.589001 -1.489355
D  0.188695 -0.758872  0.955057 -0.744542
E  0.190794  1.978757  0.683509  2.796762

In [252]:
df[df['Z']<0]

          W         X         Z       new
C -2.018168  0.740122 -0.589001 -1.489355

In [253]:
result_df = df[df['W']>0]

In [254]:
result_df

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
B  0.651118 -0.319318  0.605965 -0.196959
D  0.188695 -0.758872  0.955057 -0.744542
E  0.190794  1.978757  0.683509  2.796762

In [255]:
result_df['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [256]:
df[df['W']>0][['X','new']]

          X       new
A  0.628133  3.614819
B -0.319318 -0.196959
D -0.758872 -0.744542
E  1.978757  2.796762

In [257]:
result_df = df[df['W']>0]

In [258]:
result_df

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
B  0.651118 -0.319318  0.605965 -0.196959
D  0.188695 -0.758872  0.955057 -0.744542
E  0.190794  1.978757  0.683509  2.796762

In [259]:
result_df[['X','new']]

          X       new
A  0.628133  3.614819
B -0.319318 -0.196959
D -0.758872 -0.744542
E  1.978757  2.796762

In [260]:
#using multiple conditions

In [261]:
df

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
B  0.651118 -0.319318  0.605965 -0.196959
C -2.018168  0.740122 -0.589001 -1.489355
D  0.188695 -0.758872  0.955057 -0.744542
E  0.190794  1.978757  0.683509  2.796762

In [262]:
df[(df['W']>0) & (df['new']>0)]

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
E  0.190794  1.978757  0.683509  2.796762

In [263]:
df[(df['W']>0) | (df['new']>0)]

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
B  0.651118 -0.319318  0.605965 -0.196959
D  0.188695 -0.758872  0.955057 -0.744542
E  0.190794  1.978757  0.683509  2.796762

In [264]:
False & False

False

In [265]:
True & True

True

In [266]:
False & True

False

In [267]:
True & False

False

In [268]:
#reseting the index or setting the index to something else

In [269]:
df

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
B  0.651118 -0.319318  0.605965 -0.196959
C -2.018168  0.740122 -0.589001 -1.489355
D  0.188695 -0.758872  0.955057 -0.744542
E  0.190794  1.978757  0.683509  2.796762

In [270]:
df.reset_index() #if you want to make it permamnent use inplace=true

  index         W         X         Z       new
0     A  2.706850  0.628133  0.503826  3.614819
1     B  0.651118 -0.319318  0.605965 -0.196959
2     C -2.018168  0.740122 -0.589001 -1.489355
3     D  0.188695 -0.758872  0.955057 -0.744542
4     E  0.190794  1.978757  0.683509  2.796762

In [271]:
df

          W         X         Z       new
A  2.706850  0.628133  0.503826  3.614819
B  0.651118 -0.319318  0.605965 -0.196959
C -2.018168  0.740122 -0.589001 -1.489355
D  0.188695 -0.758872  0.955057 -0.744542
E  0.190794  1.978757  0.683509  2.796762

In [272]:
newind = 'CA NY WY OR CO'.split()

In [273]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [274]:
df['States'] = newind

In [275]:
df

          W         X         Z       new States
A  2.706850  0.628133  0.503826  3.614819     CA
B  0.651118 -0.319318  0.605965 -0.196959     NY
C -2.018168  0.740122 -0.589001 -1.489355     WY
D  0.188695 -0.758872  0.955057 -0.744542     OR
E  0.190794  1.978757  0.683509  2.796762     CO

In [276]:
df.set_index('States', inplace = True)

In [277]:
df

               W         X         Z       new
States
CA      2.706850  0.628133  0.503826  3.614819
NY      0.651118 -0.319318  0.605965 -0.196959
WY     -2.018168  0.740122 -0.589001 -1.489355
OR      0.188695 -0.758872  0.955057 -0.744542
CO      0.190794  1.978757  0.683509  2.796762